# Chapter 12. Advanced pandas

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

<frozen importlib._bootstrap>:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
<frozen importlib._bootstrap>:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
<frozen importlib._bootstrap>:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
<frozen importlib._bootstrap>:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject
<frozen importlib._bootstrap>:219: RuntimeWarning: numpy.ufunc size changed, may indicate binary incompatibility. Expected 192 from C header, got 216 from PyObject

In [2]:
sns.set()

# 12.1 Categorical Data  

> McKinney, Wes. Python for Data Analysis (p. 545). O'Reilly Media. Kindle Edition.

In [3]:
values = pd.Series(['apple','orange','apple','apple']*2)
values

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
dtype: object

In [4]:
values.unique()

array(['apple', 'orange'], dtype=object)

In [5]:
values.nunique()

2

In [6]:
values.value_counts()

apple     6
orange    2
dtype: int64

## Dimension Tables

In [7]:
values = pd.Series([0,1,0,0,]*2)
dim=pd.Series(['apple','orange'])

In [8]:
values

0    0
1    1
2    0
3    0
4    0
5    1
6    0
7    0
dtype: int64

In [9]:
dim

0     apple
1    orange
dtype: object

In [10]:
dim.take(values)
# Return the elements in the given *positional* indices along an axis.

0     apple
1    orange
0     apple
0     apple
0     apple
1    orange
0     apple
0     apple
dtype: object

In [11]:
np.random.seed(14)
fruits = ['apple', 'orange', 'apple', 'apple'] * 2
N = len(fruits)
df = pd.DataFrame({'fruit': fruits, 'basket_id': np.arange(N),
                   'count': np.random.randint( 3, 15, size = N),
                   'weight': np.random.uniform( 0, 4, size = N)},
                  columns =['basket_id', 'fruit', 'count', 'weight'])
df

   basket_id   fruit  count    weight
0          0   apple     14  3.830415
1          1  orange     11  2.052467
2          2   apple      9  1.273138
3          3   apple     10  2.156800
4          4   apple     12  0.885020
5          5  orange      9  3.225925
6          6   apple     13  1.369019
7          7   apple     13  2.155555

In [12]:
fruit_cat=df['fruit'].astype('category')
fruit_cat

0     apple
1    orange
2     apple
3     apple
4     apple
5    orange
6     apple
7     apple
Name: fruit, dtype: category
Categories (2, object): [apple, orange]

In [13]:
c=fruit_cat.values
type(c)

pandas.core.arrays.categorical.Categorical

In [16]:
fruit_cat.values.categories

Index(['apple', 'orange'], dtype='object')

In [17]:
fruit_cat.values.codes

array([0, 1, 0, 0, 0, 1, 0, 0], dtype=int8)

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   basket_id  8 non-null      int32
 1   fruit      8 non-null      object
 2   count      8 non-null      int32
 3   weight     8 non-null      float64
dtypes: float64(1), int32(2), object(1)
memory usage: 320.0+ bytes

In [19]:
df['fruit']=df['fruit'].astype('category')

In [20]:
df

   basket_id   fruit  count    weight
0          0   apple     14  3.830415
1          1  orange     11  2.052467
2          2   apple      9  1.273138
3          3   apple     10  2.156800
4          4   apple     12  0.885020
5          5  orange      9  3.225925
6          6   apple     13  1.369019
7          7   apple     13  2.155555

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   basket_id  8 non-null      int32
 1   fruit      8 non-null      category
 2   count      8 non-null      int32
 3   weight     8 non-null      float64
dtypes: category(1), float64(1), int32(2)
memory usage: 360.0 bytes

In [23]:
my_categories = pd.Categorical(['foo', 'bar', 'baz', 'foo', 'bar'])
my_categories

[foo, bar, baz, foo, bar]
Categories (3, object): [bar, baz, foo]

In [24]:
categories = pd.Categorical(['foo', 'bar', 'baz'])
codes = [0, 1, 2, 0, 0, 1]
my_cats_2 = pd.Categorical.from_codes(codes,categories)
my_cats_2

[bar, baz, foo, bar, bar, baz]
Categories (3, object): [bar, baz, foo]

In [25]:
ordered_cats = pd.Categorical.from_codes(codes,categories,ordered=True)
ordered_cats

[bar, baz, foo, bar, bar, baz]
Categories (3, object): [bar < baz < foo]

## converting to ordered

In [26]:
my_cats_2.as_ordered()

[bar, baz, foo, bar, bar, baz]
Categories (3, object): [bar < baz < foo]

# Computations with Categoricals

In [27]:
np.random.seed(12345) 
draws = np.random.randn(1000)
draws[:5]

array([-0.20470766,  0.47894334, -0.51943872, -0.5557303 ,  1.96578057])

In [28]:
bins = pd.qcut( draws, 4)
bins

[(-0.684, -0.0101], (-0.0101, 0.63], (-0.684, -0.0101], (-0.684, -0.0101], (0.63, 3.928], ..., (-0.0101, 0.63], (-0.684, -0.0101], (-2.9499999999999997, -0.684], (-0.0101, 0.63], (0.63, 3.928]]
Length: 1000
Categories (4, interval[float64]): [(-2.9499999999999997, -0.684] < (-0.684, -0.0101] < (-0.0101, 0.63] < (0.63, 3.928]]

In [29]:
# Using labels
bins = pd.qcut( draws, 4,labels=['Q1','Q2','Q3','Q4'])
bins

[Q2, Q3, Q2, Q2, Q4, ..., Q3, Q2, Q1, Q3, Q4]
Length: 1000
Categories (4, object): [Q1 < Q2 < Q3 < Q4]

In [30]:
bins.categories

Index(['Q1', 'Q2', 'Q3', 'Q4'], dtype='object')

In [32]:
bins.codes[:10]

array([1, 2, 1, 1, 3, 3, 2, 2, 3, 3], dtype=int8)

In [33]:
bins = pd.Series( bins, name ='quartile')
results = (pd.Series(draws).groupby(bins).agg(['count', 'min', 'max']).reset_index())
results

  quartile  count       min       max
0       Q1    250 -2.949343 -0.685484
1       Q2    250 -0.683066 -0.010115
2       Q3    250 -0.010032  0.628894
3       Q4    250  0.634238  3.927528

In [35]:
pd.Series(draws)

0     -0.204708
1      0.478943
2     -0.519439
3     -0.555730
4      1.965781
         ...
995    0.107657
996   -0.139298
997   -1.159926
998    0.618965
999    1.373890
Length: 1000, dtype: float64

In [36]:
N= 10000000
draws=pd.Series(np.random.randn(N))
labels=pd.Series(['foo','bar','baz','qux']*(N//4))

In [37]:
labels

0          foo
1          bar
2          baz
3          qux
4          foo
          ...
9999995    qux
9999996    foo
9999997    bar
9999998    baz
9999999    qux
Length: 10000000, dtype: object

In [38]:
categories=labels.astype('category')

In [39]:
labels.memory_usage(),categories.memory_usage()

(80000128, 10000320)

In [40]:
# conversion is one time cost

%time _ = labels.astype('category')

Wall time: 382 ms

In [42]:

s = pd.Series(['a', 'b', 'c', 'd'] * 2)
cat_s=s.astype('category')
cat_s

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (4, object): [a, b, c, d]

In [43]:
cat_s.cat.codes

0    0
1    1
2    2
3    3
4    0
5    1
6    2
7    3
dtype: int8

In [44]:
cat_s.cat.categories

Index(['a', 'b', 'c', 'd'], dtype='object')

In [46]:
actual_categories = ['a', 'b', 'c', 'd', 'e']
cat_s2 = cat_s.cat.set_categories(actual_categories)
cat_s2

0    a
1    b
2    c
3    d
4    a
5    b
6    c
7    d
dtype: category
Categories (5, object): [a, b, c, d, e]

In [47]:
cat_s.value_counts(),cat_s2.value_counts()

(d    2
 c    2
 b    2
 a    2
 dtype: int64,
 d    2
 c    2
 b    2
 a    2
 e    0
 dtype: int64)

In [48]:
cat_s.value_counts(normalize=True),cat_s2.value_counts(normalize=True)

(d    0.25
 c    0.25
 b    0.25
 a    0.25
 dtype: float64,
 d    0.25
 c    0.25
 b    0.25
 a    0.25
 e    0.00
 dtype: float64)

In [49]:
cat_s3 = cat_s[cat_s.isin(['a', 'b'])]
cat_s3

0    a
1    b
4    a
5    b
dtype: category
Categories (4, object): [a, b, c, d]

In [50]:
cat_s3.cat.remove_unused_categories()

0    a
1    b
4    a
5    b
dtype: category
Categories (2, object): [a, b]

# Creating dummy variables for modeling

In [52]:
cat_s = pd.Series(['a', 'b', 'c', 'd'] * 2, dtype ='category')
pd.get_dummies(cat_s)

   a  b  c  d
0  1  0  0  0
1  0  1  0  0
2  0  0  1  0
3  0  0  0  1
4  1  0  0  0
5  0  1  0  0
6  0  0  1  0
7  0  0  0  1

# pandas groupby print_groups_head

In [53]:
def print_grp_head(df_grp_by):
    for key,grp in df_grp_by:
        print(key,' -> ')
        print(grp.head())

In [54]:
df = pd.DataFrame({'key': ['a', 'b', 'c'] * 4,'value': np.arange(12.)})
df.head()

  key  value
0   a    0.0
1   b    1.0
2   c    2.0
3   a    3.0
4   b    4.0

In [55]:
print_grp_head(df.groupby('key'))

a  ->
  key  value
0   a    0.0
3   a    3.0
6   a    6.0
9   a    9.0
b  ->
   key  value
1    b    1.0
4    b    4.0
7    b    7.0
10   b   10.0
c  ->
   key  value
2    c    2.0
5    c    5.0
8    c    8.0
11   c   11.0

In [56]:
g = df.groupby('key').value
g

In [57]:
print_grp_head(g)

a  ->
0    0.0
3    3.0
6    6.0
9    9.0
Name: value, dtype: float64
b  ->
1      1.0
4      4.0
7      7.0
10    10.0
Name: value, dtype: float64
c  ->
2      2.0
5      5.0
8      8.0
11    11.0
Name: value, dtype: float64

In [58]:
g.mean()

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [59]:
g.transform(lambda x: x.mean()) # x is groupby series group

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [60]:
g.transform('mean')

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [61]:
g.transform( lambda x: x * 2)

0      0.0
1      2.0
2      4.0
3      6.0
4      8.0
5     10.0
6     12.0
7     14.0
8     16.0
9     18.0
10    20.0
11    22.0
Name: value, dtype: float64

In [62]:
g.transform( lambda x: x.rank(ascending=False))

0     4.0
1     4.0
2     4.0
3     3.0
4     3.0
5     3.0
6     2.0
7     2.0
8     2.0
9     1.0
10    1.0
11    1.0
Name: value, dtype: float64

In [63]:
def normalize(x): 
    'x: group of groupby obeject'
    return (x - x.mean()) / x.std()

In [64]:
g.transform(normalize)

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

In [65]:
g.apply(normalize)

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

In [70]:
%time g.transform('mean')

Wall time: 2 ms

0     4.5
1     5.5
2     6.5
3     4.5
4     5.5
5     6.5
6     4.5
7     5.5
8     6.5
9     4.5
10    5.5
11    6.5
Name: value, dtype: float64

In [71]:
%time g.apply(lambda x: x.mean())

Wall time: 3 ms

key
a    4.5
b    5.5
c    6.5
Name: value, dtype: float64

In [72]:
normalized = (df['value'] - g.transform('mean')) / g.transform('std')

In [73]:
normalized

0    -1.161895
1    -1.161895
2    -1.161895
3    -0.387298
4    -0.387298
5    -0.387298
6     0.387298
7     0.387298
8     0.387298
9     1.161895
10    1.161895
11    1.161895
Name: value, dtype: float64

# Grouped Time Resampling

In [83]:
N=15
times = pd.date_range('2017-05-20 00:00', freq ='1min', periods = N) 
df = pd.DataFrame({'time': times, 'value': np.arange(N)})
df.head()

                 time  value
0 2017-05-20 00:00:00      0
1 2017-05-20 00:01:00      1
2 2017-05-20 00:02:00      2
3 2017-05-20 00:03:00      3
4 2017-05-20 00:04:00      4

In [84]:
df.set_index('time').resample('5min').count()

                     value
time
2017-05-20 00:00:00      5
2017-05-20 00:05:00      5
2017-05-20 00:10:00      5

In [85]:
df2 = pd.DataFrame({'time': times.repeat(3),
                    'key': np.tile(['a', 'b', 'c'], N),
                    'value': np.arange( N * 3.)})
df2[:7]

                 time key  value
0 2017-05-20 00:00:00   a    0.0
1 2017-05-20 00:00:00   b    1.0
2 2017-05-20 00:00:00   c    2.0
3 2017-05-20 00:01:00   a    3.0
4 2017-05-20 00:01:00   b    4.0
5 2017-05-20 00:01:00   c    5.0
6 2017-05-20 00:02:00   a    6.0

In [92]:
df2.shape

(45, 3)

In [89]:
time_key = pd.Grouper(freq='5min')
time_key

TimeGrouper(freq=<5 * Minutes>, axis=0, sort=True, closed='left', label='left', how='mean', convention='e', base=0)

In [90]:
resampled=(df2.set_index('time').groupby(['key',time_key])).sum()

In [91]:
resampled

                         value
key time
a   2017-05-20 00:00:00   30.0
    2017-05-20 00:05:00  105.0
    2017-05-20 00:10:00  180.0
b   2017-05-20 00:00:00   35.0
    2017-05-20 00:05:00  110.0
    2017-05-20 00:10:00  185.0
c   2017-05-20 00:00:00   40.0
    2017-05-20 00:05:00  115.0
    2017-05-20 00:10:00  190.0

In [93]:
resampled.reset_index()

  key                time  value
0   a 2017-05-20 00:00:00   30.0
1   a 2017-05-20 00:05:00  105.0
2   a 2017-05-20 00:10:00  180.0
3   b 2017-05-20 00:00:00   35.0
4   b 2017-05-20 00:05:00  110.0
5   b 2017-05-20 00:10:00  185.0
6   c 2017-05-20 00:00:00   40.0
7   c 2017-05-20 00:05:00  115.0
8   c 2017-05-20 00:10:00  190.0

# 12.3 Techniques for Method Chaining

## The pipe Method

McKinney, Wes. Python for Data Analysis (p. 569). O'Reilly Media. Kindle Edition.

In [101]:
df2.head(10)

                 time key  value
0 2017-05-20 00:00:00   a    0.0
1 2017-05-20 00:00:00   b    1.0
2 2017-05-20 00:00:00   c    2.0
3 2017-05-20 00:01:00   a    3.0
4 2017-05-20 00:01:00   b    4.0
5 2017-05-20 00:01:00   c    5.0
6 2017-05-20 00:02:00   a    6.0
7 2017-05-20 00:02:00   b    7.0
8 2017-05-20 00:02:00   c    8.0
9 2017-05-20 00:03:00   a    9.0

In [103]:
def group_demean( df, by, cols):
    result = df.copy() 
    g = df.groupby(by) 
    for c in cols:
        result[c] = df[c] - g[c].transform('mean') 
    return result

In [105]:
result = (df2.pipe(group_demean, ['key'], ['value']))
result

                  time key  value
0  2017-05-20 00:00:00   a  -21.0
1  2017-05-20 00:00:00   b  -21.0
2  2017-05-20 00:00:00   c  -21.0
3  2017-05-20 00:01:00   a  -18.0
4  2017-05-20 00:01:00   b  -18.0
5  2017-05-20 00:01:00   c  -18.0
6  2017-05-20 00:02:00   a  -15.0
7  2017-05-20 00:02:00   b  -15.0
8  2017-05-20 00:02:00   c  -15.0
9  2017-05-20 00:03:00   a  -12.0
10 2017-05-20 00:03:00   b  -12.0
11 2017-05-20 00:03:00   c  -12.0
12 2017-05-20 00:04:00   a   -9.0
13 2017-05-20 00:04:00   b   -9.0
14 2017-05-20 00:04:00   c   -9.0
15 2017-05-20 00:05:00   a   -6.0
16 2017-05-20 00:05:00   b   -6.0
17 2017-05-20 00:05:00   c   -6.0
18 2017-05-20 00:06:00   a   -3.0
19 2017-05-20 00:06:00   b   -3.0
20 2017-05-20 00:06:00   c   -3.0
21 2017-05-20 00:07:00   a    0.0
22 2017-05-20 00:07:00   b    0.0
23 2017-05-20 00:07:00   c    0.0
24 2017-05-20 00:08:00   a    3.0
25 2017-05-20 00:08:00   b    3.0
26 2017-05-20 00:08:00   c    3.0
27 2017-05-20 00:09:00   a    6.0
28 2017-05-20 00:09:00   b    6.0
29 2017-05-20 00:09:00   c    6.0
30 2017-05-20 00:10:00   a    9.0
31 2017-05-20 00:10:00   b    9.0
32 2017-05-20 00:10:00   c    9.0
33 2017-05-20 00:11:00   a   12.0
34 2017-05-20 00:11:00   b   12.0
35 2017-05-20 00:11:00   c   12.0
36 2017-05-20 00:12:00   a   15.0
37 2017-05-20 00:12:00   b   15.0
38 2017-05-20 00:12:00   c   15.0
39 2017-05-20 00:13:00   a   18.0
40 2017-05-20 00:13:00   b   18.0
41 2017-05-20 00:13:00   c   18.0
42 2017-05-20 00:14:00   a   21.0
43 2017-05-20 00:14:00   b   21.0
44 2017-05-20 00:14:00   c   21.0